БПКР/src/Documents/ОтчетПоНалогуНаИмущество/ОтчетПоНалогуНаИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоНалогуНаИмущество</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Недвижимость</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаИмущества</name>
      <type>
        <types>CatalogRef.ГруппыИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМесяцев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОценочнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПлощадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЖилаяПлощадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кз</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ко</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МатериалСтен</name>
      <type>
        <types>CatalogRef.ВидыМатериаловСтенНалогНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗемельныйНалог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИмущества</name>
      <type>
        <types>CatalogRef.КодыИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>КодНазначенияИмущества</name>
      <type>
        <types>CatalogRef.ОтраслевыеКоэффициентыНалогНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПользователяИмущества</name>
      <type>
        <types>CatalogRef.КодыПользователейИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВводаВЭксплуатацию</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаИмущества</name>
      <type>
        <types>CatalogRef.ГруппыИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>АБВ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДвигателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспорта</name>
      <type>
        <types>CatalogRef.ВидыТранспортаНалогНаИмущество</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаТранспортногоСредства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГосНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПользователяИмущества</name>
      <type>
        <types>CatalogRef.КодыПользователейИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>БалансоваяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приложение</name>
    <attributes>
      <name>ГруппаИмущества</name>
      <type>
        <types>CatalogRef.ГруппыИмущества</types>
      </type>
    </attributes>
    <attributes>
      <name>Январь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Февраль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Март</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Апрель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Май</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Июнь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Июль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Август</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сентябрь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Октябрь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ноябрь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Декабрь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Catalogs/ГруппыИмущества/ГруппыИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыИмущества</name>
  <predefined>
    <items>
      <name>ГИ2</name>
      <description>2 группа</description>
    </items>
    <items>
      <name>ГИ3</name>
      <description>3 группа</description>
    </items>
    <items>
      <name>ГИ4с</name>
      <description>4 группа</description>
    </items>
    <items>
      <name>ГИ4нс</name>
      <description>4 группа(несамоходные)</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/Catalogs/ВидыТранспортаНалогНаИмущество/ВидыТранспортаНалогНаИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыТранспортаНалогНаИмущество</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияАБВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>удалитьШкалаОценкиСтоимости</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БПКР/src/Documents/ОтчетПоНалогуНаИмущество/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета)
	
	КонтактныеДанные = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСведенияОбОрганизации(СтруктураПараметров.Организация, СтруктураПараметров.Дата);
	
	ДанныеПечати = Новый Структура();
	
	ДанныеПечати.Вставить("НаименованиеОрганизации", КонтактныеДанные.НаименованиеПолное);
	ДанныеПечати.Вставить("НаименованиеНалоговой", КонтактныеДанные.ГНСНаименование);
	ДанныеПечати.Вставить("АдресГород", КонтактныеДанные.Город);
	ДанныеПечати.Вставить("АдресУлица", КонтактныеДанные.Улица);
	ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Тел);
	
	ОКПО = КонтактныеДанные.ОКПО;
	ДанныеПечати.Вставить("ОКПО1", Сред(ОКПО,1,1));
	ДанныеПечати.Вставить("ОКПО2", Сред(ОКПО,2,1));
	ДанныеПечати.Вставить("ОКПО3", Сред(ОКПО,3,1));
	ДанныеПечати.Вставить("ОКПО4", Сред(ОКПО,4,1));
	ДанныеПечати.Вставить("ОКПО5", Сред(ОКПО,5,1));
	ДанныеПечати.Вставить("ОКПО6", Сред(ОКПО,6,1));
	ДанныеПечати.Вставить("ОКПО7", Сред(ОКПО,7,1));
	ДанныеПечати.Вставить("ОКПО8", Сред(ОКПО,8,1));

	ИНН = КонтактныеДанные.ИНН;
	ДанныеПечати.Вставить("ИНН1", Сред(ИНН, 1, 1));
	ДанныеПечати.Вставить("ИНН2", Сред(ИНН, 2, 1));
	ДанныеПечати.Вставить("ИНН3", Сред(ИНН, 3, 1));                           
	ДанныеПечати.Вставить("ИНН4", Сред(ИНН, 4, 1));
	ДанныеПечати.Вставить("ИНН5", Сред(ИНН, 5, 1));
	ДанныеПечати.Вставить("ИНН6", Сред(ИНН, 6, 1));
	ДанныеПечати.Вставить("ИНН7", Сред(ИНН, 7, 1));
	ДанныеПечати.Вставить("ИНН8", Сред(ИНН, 8, 1));
	ДанныеПечати.Вставить("ИНН9", Сред(ИНН, 9, 1));
	ДанныеПечати.Вставить("ИНН10", Сред(ИНН, 10, 1));
	ДанныеПечати.Вставить("ИНН11", Сред(ИНН, 11, 1));
	ДанныеПечати.Вставить("ИНН12", Сред(ИНН, 12, 1));
	ДанныеПечати.Вставить("ИНН13", Сред(ИНН, 13, 1));
	ДанныеПечати.Вставить("ИНН14", Сред(ИНН, 14, 1));         
	
	КодГНС = КонтактныеДанные.ГНСКод;
	ДанныеПечати.Вставить("ГНС1", Сред(КодГНС, 1, 1));
	ДанныеПечати.Вставить("ГНС2", Сред(КодГНС, 2, 1));
	ДанныеПечати.Вставить("ГНС3", Сред(КодГНС, 3, 1));
	
	КодРайона = КонтактныеДанные.ГНСКод;
	ДанныеПечати.Вставить("КодРайона1", Сред(КодГНС, 1, 1));
	ДанныеПечати.Вставить("КодРайона2", Сред(КодГНС, 2, 1));
	ДанныеПечати.Вставить("КодРайона3", Сред(КодГНС, 3, 1));
	
	Год = Формат(Год(СтруктураПараметров.Дата), "ЧГ=0");	
	
	ДанныеПечати.Вставить("ГОД1", Сред(Год, 1, 1));	
	ДанныеПечати.Вставить("ГОД2", Сред(Год, 2, 1));
	ДанныеПечати.Вставить("ГОД3", Сред(Год, 3, 1));
	ДанныеПечати.Вставить("ГОД4", Сред(Год, 4, 1));
	
	НачалоПериода = НачалоГода(СтруктураПараметров.Дата);
	ДанныеПечати.Вставить("ДатаН1", Сред(НачалоПериода, 1, 1));	
	ДанныеПечати.Вставить("ДатаН2", Сред(НачалоПериода, 2, 1));	
	ДанныеПечати.Вставить("ДатаН3", Сред(НачалоПериода, 4, 1));	
	ДанныеПечати.Вставить("ДатаН4", Сред(НачалоПериода, 5, 1));	
	ДанныеПечати.Вставить("ДатаН5", Сред(НачалоПериода, 7, 1));	
	ДанныеПечати.Вставить("ДатаН6", Сред(НачалоПериода, 8, 1));	
	ДанныеПечати.Вставить("ДатаН7", Сред(НачалоПериода, 9, 1));	
	ДанныеПечати.Вставить("ДатаН8", Сред(НачалоПериода, 10, 1));	
	
	КонецПериода = КонецГода(СтруктураПараметров.Дата);		
	ДанныеПечати.Вставить("ДатаК1", Сред(КонецПериода, 1, 1));	
	ДанныеПечати.Вставить("ДатаК2", Сред(КонецПериода, 2, 1));	
	ДанныеПечати.Вставить("ДатаК3", Сред(КонецПериода, 4, 1));	
	ДанныеПечати.Вставить("ДатаК4", Сред(КонецПериода, 5, 1));	
	ДанныеПечати.Вставить("ДатаК5", Сред(КонецПериода, 7, 1));	
	ДанныеПечати.Вставить("ДатаК6", Сред(КонецПериода, 8, 1));	
	ДанныеПечати.Вставить("ДатаК7", Сред(КонецПериода, 9, 1));	
	ДанныеПечати.Вставить("ДатаК8", Сред(КонецПериода, 10, 1));

	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
КонецПроцедуры

Процедура ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, ГруппаИмущества, КодПризнакаТС = Неопределено)

	Если ГруппаИмущества = 4 Тогда
		ОбластьМакета.Параметры.номер1 = ПервыйНомер;
		ОбластьМакета.Параметры.номер2 = ПервыйНомер + 1;
		ОбластьМакета.Параметры.номер3 = ПервыйНомер + 2;
		ОбластьМакета.Параметры.номер4 = ПервыйНомер + 3;
		ОбластьМакета.Параметры.номер5 = ПервыйНомер + 4;
		ОбластьМакета.Параметры.номер6 = ПервыйНомер + 5;
		ОбластьМакета.Параметры.номер7 = ПервыйНомер + 6;
		
		Если КодПризнакаТС = "А" Тогда
			ОбластьМакета.Параметры.номер8 = ПервыйНомер + 7;
			ПервыйНомер = ПервыйНомер + 8;			
		Иначе
			ПервыйНомер = ПервыйНомер + 7;
		КонецЕсли;	
		
	Иначе
		ОбластьМакета.Параметры.ЕАЭС0  = ПервыйНомер;
		ОбластьМакета.Параметры.ЕАЭС1  = ПервыйНомер + 1;
		ОбластьМакета.Параметры.ЕАЭС2  = ПервыйНомер + 2;
		ОбластьМакета.Параметры.ЕАЭС3  = ПервыйНомер + 3;
		ОбластьМакета.Параметры.ЕАЭС4  = ПервыйНомер + 4;
		ОбластьМакета.Параметры.ЕАЭС5  = ПервыйНомер + 5;
		ОбластьМакета.Параметры.ЕАЭС6  = ПервыйНомер + 6;
		ОбластьМакета.Параметры.ЕАЭС7  = ПервыйНомер + 7;
		ОбластьМакета.Параметры.ЕАЭС8  = ПервыйНомер + 8;
		ОбластьМакета.Параметры.ЕАЭС9  = ПервыйНомер + 9;
		ОбластьМакета.Параметры.ЕАЭС10 = ПервыйНомер + 10;
		ОбластьМакета.Параметры.ЕАЭС11 = ПервыйНомер + 11;
		ОбластьМакета.Параметры.ЕАЭС12 = ПервыйНомер + 12;
		ОбластьМакета.Параметры.ЕАЭС13 = ПервыйНомер + 13;
		ОбластьМакета.Параметры.ЕАЭС14 = ПервыйНомер + 14;
		
		Если ГруппаИмущества = 2 Тогда
			ОбластьМакета.Параметры.ЕАЭС15 = ПервыйНомер + 15;	
			ПервыйНомер = ПервыйНомер + 16;
			
		ИначеЕсли ГруппаИмущества = 3 Тогда
			ПервыйНомер = ПервыйНомер + 15;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//@skip-warning
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой Приложение5ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;     
	ПервыйДокумент = Истина;
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Приложение5";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5");
		
		
		Запрос = Новый Запрос;		
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ОтчетПоНалогуНаИмуществоНедвижимость.ОсновноеСредство КАК ОсновноеСредство,
		|	ОтчетПоНалогуНаИмуществоНедвижимость.ГруппаИмущества КАК ГруппаИмущества,
		|	ОтчетПоНалогуНаИмуществоНедвижимость.СуммаНалога КАК СуммаНалога,
		|	ОтчетПоНалогуНаИмуществоНедвижимость.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнтаяТаблицаНедвижимость
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество.Недвижимость КАК ОтчетПоНалогуНаИмуществоНедвижимость
		|ГДЕ
		|	ОтчетПоНалогуНаИмуществоНедвижимость.Ссылка = &ТекущийДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнтаяТаблицаНедвижимость.СуммаНалога) КАК СуммаНалога2,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнтаяТаблицаНедвижимость.ОсновноеСредство) КАК Количество2,
		|	0 КАК СуммаНалога3,
		|	0 КАК Количество3,
		|	0 КАК СуммаНалога4,
		|	0 КАК Количество4
		|ПОМЕСТИТЬ ВременнаяТаблицаСвод
		|ИЗ
		|	ВременнтаяТаблицаНедвижимость КАК ВременнтаяТаблицаНедвижимость
		|ГДЕ
		|	ВременнтаяТаблицаНедвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	СУММА(ВременнтаяТаблицаНедвижимость.СуммаНалога),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнтаяТаблицаНедвижимость.ОсновноеСредство),
		|	0,
		|	0
		|ИЗ
		|	ВременнтаяТаблицаНедвижимость КАК ВременнтаяТаблицаНедвижимость
		|ГДЕ
		|	ВременнтаяТаблицаНедвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	0,
		|	СУММА(ОтчетПоНалогуНаИмуществоТранспорт.СуммаНалога),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОтчетПоНалогуНаИмуществоТранспорт.ОсновноеСредство)
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество.Транспорт КАК ОтчетПоНалогуНаИмуществоТранспорт
		|ГДЕ
		|	ОтчетПоНалогуНаИмуществоТранспорт.Ссылка = &ТекущийДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога2) КАК СуммаНалога2,
		|	СУММА(ВременнаяТаблицаСвод.Количество2) КАК Количество2,
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога3) КАК СуммаНалога3,
		|	СУММА(ВременнаяТаблицаСвод.Количество3) КАК Количество3,
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога4) КАК СуммаНалога4,
		|	СУММА(ВременнаяТаблицаСвод.Количество4) КАК Количество4
		|ИЗ
		|	ВременнаяТаблицаСвод КАК ВременнаяТаблицаСвод";
		
		
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ДанныеПечати = Новый Структура();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
		СтруктураПараметров.Вставить("Дата", ТекущийДокумент.Дата);
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		
		СтруктураИтоги = Новый Структура();
		СтруктураИтоги.Вставить("ИтогоСуммаНалога", Выборка.СуммаНалога2 + Выборка.СуммаНалога3 + Выборка.СуммаНалога4 );
		ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5_01ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5_01(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ОтчетПоНалогуНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетПоНалогуНаИмущество.Организация КАК Организация,
		|	ОтчетПоНалогуНаИмущество.Дата КАК Дата,
		|	ОтчетПоНалогуНаИмущество.Недвижимость.(
		|		НомерСтроки КАК НомерСтроки,
		|		ОсновноеСредство КАК ОсновноеСредство,
		|		ГруппаИмущества КАК ГруппаИмущества,
		|		КодИмущества КАК КодВидаИмущества,
		|		КодПользователяИмущества КАК КодПользователяИмущества,
		|		ОсновноеСредство.ИдентификационныйНомерИмущества КАК ИдентификационныйКодИмущества,
		|		СуммаНалога КАК СуммаНалога,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь
		|	) КАК Недвижимость
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетПоНалогуНаИмущество
		|ГДЕ
		|	ОтчетПоНалогуНаИмущество.Ссылка В(&МассивОбъектов)";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Приложение5_01";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5_01");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", Шапка.Дата);
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ИтогиПоПриложению = Новый Структура();
		ИтогиПоПриложению.Вставить("СуммаНалога", 	0);
		
		// Детали
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
		КоличествоСтрок = ВыборкаНедвижимость.Количество();
		Пока ВыборкаНедвижимость.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
			ИтогиПоПриложению.СуммаНалога 	= ИтогиПоПриложению.СуммаНалога + ВыборкаНедвижимость.СуммаНалога;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 28 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итог");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ИтогиПоПриложению);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5_02ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5_02(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ОтчетПоНалогуНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетПоНалогуНаИмущество.Организация КАК Организация,
		|	ОтчетПоНалогуНаИмущество.Дата КАК Дата,
		|	ОтчетПоНалогуНаИмущество.Транспорт.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ВидТранспорта.Код КАК КодВидаТранспорта,
		|		МаркаТранспортногоСредства КАК МаркаТранспортногоСредства,
		|		СуммаНалога КАК СуммаНалога
		|	) КАК Транспорт
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетПоНалогуНаИмущество
		|ГДЕ
		|	ОтчетПоНалогуНаИмущество.Ссылка В(&МассивОбъектов)";


	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Приложение5_02";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5_02");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", Шапка.Дата);
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ИтогиПоПриложению = Новый Структура();
		ИтогиПоПриложению.Вставить("СуммаНалога", 	0);
		
		// Детали
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		ВыборкаТранспорт = Шапка.Транспорт.Выбрать();
		КоличествоСтрок = ВыборкаТранспорт.Количество();
		Пока ВыборкаТранспорт.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
			ИтогиПоПриложению.СуммаНалога 	= ИтогиПоПриложению.СуммаНалога + ВыборкаТранспорт.СуммаНалога;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 28 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итог");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ИтогиПоПриложению);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НалогаНаИмущество2Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмуществоПриложение11(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмущество.Дата КАК Дата,
		|	ОтчетНалогНаИмущество.Организация КАК Организация,
		|	ОтчетНалогНаИмущество.Недвижимость.(
		|		ОсновноеСредство.ИдентификационныйНомерИмущества КАК ИдентификационныйКодИмущества,
		|		ВЫБОР
		|			КОГДА ОсновноеСредство.НаименованиеПолное = """"
		|				ТОГДА ОсновноеСредство.МестонахождениеИмущества + "" ("" + ОсновноеСредство.Наименование + "")""
		|			ИНАЧЕ ОсновноеСредство.МестонахождениеИмущества + "" ("" + ОсновноеСредство.НаименованиеПолное + "")""
		|		КОНЕЦ КАК МестонахождениеИмущества,
		|		КоличествоМесяцев КАК КоличествоМесяцевВладения,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога,
		|		ОценочнаяСтоимость КАК ОценочнаяСтоимостьМетр,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь,
		|		МатериалСтен.Код КАК КодМатериала,
		|		Кр КАК Кр,
		|		Кз КАК Кз,
		|		Ко КАК Ко,
		|		ЗемельныйНалог КАК СуммаЗемельногоНалога,
		|		КодИмущества КАК КодВидаИмущества,
		|		КодНазначенияИмущества.Код КАК КодНазначенияИмущества,
		|		КодПользователяИмущества КАК КодПользователяИмущества,
		|		ВЫБОР
		|			КОГДА ОсновноеСредство.ДатаВыпускаНедвижимости <> ДАТАВРЕМЯ(1,1,1)
		|				ТОГДА ГОД(ОсновноеСредство.ДатаВыпускаНедвижимости)
		|			ИНАЧЕ ГОД(ОтчетНалогНаИмущество.Недвижимость.ДатаВводаВЭксплуатацию)
		|		КОНЕЦ КАК ГодВводаВЭксплуатацию
		|	) КАК Недвижимость,
		|	ОтчетНалогНаИмущество.Приложение.(
		|		ГруппаИмущества КАК ГруппаИмущества,
		|		Январь КАК СуммаЗаЯнварь,
		|		Февраль КАК СуммаЗаФевраль,
		|		Март КАК СуммаЗаМарт,
		|		Апрель КАК СуммаЗаАпрель,
		|		Май КАК СуммаЗаМай,
		|		Июнь КАК СуммаЗаИюнь,
		|		Июль КАК СуммаЗаИюль,
		|		Август КАК СуммаЗаАвгуст,
		|		Сентябрь КАК СуммаЗаСентябрь,
		|		Октябрь КАК СуммаЗаОктябрь,
		|		Ноябрь КАК СуммаЗаНоябрь,
		|		Декабрь КАК СуммаЗаДекабрь
		|	) КАК Приложение
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетНалогНаИмущество
		|ГДЕ
		|	ОтчетНалогНаИмущество.Ссылка В(&МассивОбъектов)
		|	И ОтчетНалогНаИмущество.Недвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|	И ОтчетНалогНаИмущество.Приложение.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодВидаИмущества";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Приложение11";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение11");	
	ИмяМакета = "ПФ_MXL_ЕНД_Приложение11";
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	СтруктураИтоги = Новый Структура();
	СтруктураИтоги.Вставить("ИтогоСуммаНалога", 			0);
	СтруктураИтоги.Вставить("ИтогоСуммаЗемельногоНалога", 	0);
	СтруктураИтоги.Вставить("СуммаНалогаКУплате", 			0);
	
	Пока Шапка.Следующий() Цикл		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", 		Шапка.Дата);
		
	    ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
		КоличествоЗаписей = ВыборкаНедвижимость.Количество();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		КоличествоСтрок = ВыборкаНедвижимость.Количество();
		Пока ВыборкаНедвижимость.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтруктураИтоги.ИтогоСуммаНалога 			= СтруктураИтоги.ИтогоСуммаНалога 			+ ВыборкаНедвижимость.СуммаНалога;
			СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= СтруктураИтоги.ИтогоСуммаЗемельногоНалога + ВыборкаНедвижимость.СуммаЗемельногоНалога;
			СтруктураИтоги.СуммаНалогаКУплате 			= СтруктураИтоги.ИтогоСуммаНалога - СтруктураИтоги.ИтогоСуммаЗемельногоНалога;	
		
		КонецЦикла;		
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 9 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
			
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
		
		ВыборкаПриложение = Шапка.Приложение.Выбрать();
		
		Если ВыборкаПриложение.Следующий() Тогда 
			ОбластьМакета.Параметры.Заполнить(ВыборкаПриложение);
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НалогаНаИмущество3Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмуществоПриложение12(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмущество.Дата КАК Дата,
		|	ОтчетНалогНаИмущество.Организация КАК Организация,
		|	ОтчетНалогНаИмущество.Недвижимость.(
		|		ВЫБОР
		|			КОГДА ОтчетНалогНаИмущество.Недвижимость.ОсновноеСредство.НаименованиеПолное = """"
		|				ТОГДА ОтчетНалогНаИмущество.Недвижимость.ОсновноеСредство.МестонахождениеИмущества + "" ("" + ОтчетНалогНаИмущество.Недвижимость.ОсновноеСредство.Наименование + "")""
		|			ИНАЧЕ ОтчетНалогНаИмущество.Недвижимость.ОсновноеСредство.МестонахождениеИмущества + "" ("" + ОтчетНалогНаИмущество.Недвижимость.ОсновноеСредство.НаименованиеПолное + "")""
		|		КОНЕЦ КАК МестонахождениеИмущества,
		|		КоличествоМесяцев КАК КоличествоМесяцевВладения,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога,
		|		ОценочнаяСтоимость КАК ОценочнаяСтоимостьМетр,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь,
		|		МатериалСтен.Код КАК КодМатериала,
		|		Кр КАК Кр,
		|		Кз КАК Кз,
		|		Ко КАК Ко,
		|		ЗемельныйНалог КАК СуммаЗемельногоНалога,
		|		КодИмущества КАК КодВидаИмущества,
		|		КодНазначенияИмущества.Код КАК КодНазначенияИмущества,
		|		КодПользователяИмущества КАК КодПользователяИмущества,
		|		ВЫБОР
		|			КОГДА ОтчетНалогНаИмущество.Недвижимость.ОсновноеСредство.ДатаВыпускаНедвижимости <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ГОД(ОтчетНалогНаИмущество.Недвижимость.ОсновноеСредство.ДатаВыпускаНедвижимости)
		|			ИНАЧЕ ГОД(ОтчетНалогНаИмущество.Недвижимость.ДатаВводаВЭксплуатацию)
		|		КОНЕЦ КАК ГодВводаВЭксплуатацию
		|	) КАК Недвижимость,
		|	ОтчетНалогНаИмущество.Приложение.(
		|		ГруппаИмущества КАК ГруппаИмущества,
		|		Январь КАК СуммаЗаЯнварь,
		|		Февраль КАК СуммаЗаФевраль,
		|		Март КАК СуммаЗаМарт,
		|		Апрель КАК СуммаЗаАпрель,
		|		Май КАК СуммаЗаМай,
		|		Июнь КАК СуммаЗаИюнь,
		|		Июль КАК СуммаЗаИюль,
		|		Август КАК СуммаЗаАвгуст,
		|		Сентябрь КАК СуммаЗаСентябрь,
		|		Октябрь КАК СуммаЗаОктябрь,
		|		Ноябрь КАК СуммаЗаНоябрь,
		|		Декабрь КАК СуммаЗаДекабрь
		|	) КАК Приложение
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетНалогНаИмущество
		|ГДЕ
		|	ОтчетНалогНаИмущество.Ссылка В(&МассивОбъектов)
		|	И ОтчетНалогНаИмущество.Недвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|	И ОтчетНалогНаИмущество.Приложение.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодВидаИмущества";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Приложение12";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение12");	
	ИмяМакета = "ПФ_MXL_ЕНД_Приложение12";
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	СтруктураИтоги = Новый Структура();
	СтруктураИтоги.Вставить("ИтогоСуммаНалога", 			0);
	СтруктураИтоги.Вставить("ИтогоСуммаЗемельногоНалога", 	0);
	СтруктураИтоги.Вставить("СуммаНалогаКУплате", 			0);
	
	Пока Шапка.Следующий() Цикл		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", 		Шапка.Дата);
		
	    ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
		КоличествоЗаписей = ВыборкаНедвижимость.Количество();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		КоличествоСтрок = ВыборкаНедвижимость.Количество();
		Пока ВыборкаНедвижимость.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтруктураИтоги.ИтогоСуммаНалога 			= СтруктураИтоги.ИтогоСуммаНалога 			+ ВыборкаНедвижимость.СуммаНалога;
			СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= СтруктураИтоги.ИтогоСуммаЗемельногоНалога + ВыборкаНедвижимость.СуммаЗемельногоНалога;
			СтруктураИтоги.СуммаНалогаКУплате 			= СтруктураИтоги.ИтогоСуммаНалога - СтруктураИтоги.ИтогоСуммаЗемельногоНалога;	
		
		КонецЦикла;		
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 9 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
			
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
		
		ВыборкаПриложение = Шапка.Приложение.Выбрать();
		
		Если ВыборкаПриложение.Следующий() Тогда 
			ОбластьМакета.Параметры.Заполнить(ВыборкаПриложение);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НалогаНаИмущество4Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмуществоПриложение13(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ОтчетПоНалогуНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетПоНалогуНаИмущество.Организация КАК Организация,
		|	ОтчетПоНалогуНаИмущество.Дата КАК Дата,
		|	ОтчетПоНалогуНаИмущество.Организация.ГНС.Код КАК КодРайона,
		|	ОтчетПоНалогуНаИмущество.Транспорт.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		АБВ КАК АБВ,
		|		ВидТранспорта.Код КАК КодВидаТранспорта,
		|		МаркаТранспортногоСредства КАК МаркаТранспортногоСредства,
		|		ГосНомер КАК ГосНомер,
		|		КодПользователяИмущества.Код КАК КодПользователяИмущества,
		|		ВЫБОР
		|			КОГДА ГОД(ОтчетПоНалогуНаИмущество.Транспорт.ОсновноеСредство.ДатаВыпускаТранспортногоСредства) <> 1
		|				ТОГДА ГОД(ОтчетПоНалогуНаИмущество.Транспорт.ОсновноеСредство.ДатаВыпускаТранспортногоСредства)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ГодВыпуска,
		|		ВЫБОР
		|			КОГДА ОтчетПоНалогуНаИмущество.Транспорт.ВидТранспорта = &НесамоходныеТС
		|					ИЛИ ОтчетПоНалогуНаИмущество.Транспорт.ВидТранспорта = &ДругиеТС
		|				ТОГДА ОтчетПоНалогуНаИмущество.Транспорт.БалансоваяСтоимость
		|			ИНАЧЕ ОтчетПоНалогуНаИмущество.Транспорт.ОбъемДвигателя
		|		КОНЕЦ КАК ОбъемДвигателя,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога
		|	) КАК Транспорт
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетПоНалогуНаИмущество
		|ГДЕ
		|	ОтчетПоНалогуНаИмущество.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НесамоходныеТС", Справочники.ВидыТранспортаНалогНаИмущество.НайтиПоНаименованию("Несамоходные"));
	Запрос.УстановитьПараметр("ДругиеТС", 		Справочники.ВидыТранспортаНалогНаИмущество.НайтиПоНаименованию("Другие"));
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Приложение13";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение13");
	ИмяМакета = "ПФ_MXL_ЕНД_Приложение13";

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", Шапка.Дата);
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ИтогиПоПриложению = Новый Структура();
		ИтогиПоПриложению.Вставить("СуммаНалога", 	0);

		// Детали
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		ВыборкаТранспорт = Шапка.Транспорт.Выбрать();
		КоличествоСтрок = ВыборкаТранспорт.Количество();
		Пока ВыборкаТранспорт.Следующий() Цикл
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
			ИтогиПоПриложению.СуммаНалога 	= ИтогиПоПриложению.СуммаНалога + ВыборкаТранспорт.СуммаНалога;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 13 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итог");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ИтогиПоПриложению);
		ТабличныйДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5", 
		НСтр("ru = 'Приложение 5'"), 
		ПечатьПриложения5(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5_01") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5_01", 
		НСтр("ru = 'Приложение 5 - 01'"), 
		ПечатьПриложения5_01(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5_01");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5_02") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5_02", 
		НСтр("ru = 'Приложение 5 - 02'"), 
		ПечатьПриложения5_02(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5_02");
	КонецЕсли;	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЕНД_Приложение11") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_ЕНД_Приложение11", 
		НСтр("ru = 'Приложение 11. Расчет налога на имущество 2 группы'"), 
		ОтчетПоНалогуНаИмуществоПриложение11(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение11");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЕНД_Приложение12") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_ЕНД_Приложение12", 
		НСтр("ru = 'Приложение 12. Расчет налога на имущество 3 группы'"), 
		ОтчетПоНалогуНаИмуществоПриложение12(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение12");
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЕНД_Приложение13") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ПФ_MXL_ЕНД_Приложение13", 
		НСтр("ru = 'Приложение 13. Расчет налога на имущество 4 группы'"), 
		ОтчетПоНалогуНаИмуществоПриложение13(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение13");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение5,Приложение5_01,Приложение5_02";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 5 (Налог на имущество)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_ЕНД_Приложение11";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 11. Расчет налога на имущество 2 группы'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_ЕНД_Приложение12";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 12. Расчет налога на имущество 3 группы'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 3;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_ЕНД_Приложение13";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 13. Расчет налога на имущество 4 группы'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 4;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
